//所有数据：包含（省、市、县）
var allData = [
    //1级为省
    {
        provinceName:"湖南省",       //省级：省级名称
        city:[                      //市级
             {
                 cityName:"长沙市",  //市级名称
                 countyName:["芙蓉区", "天心区", "岳麓区",  "开福区", "雨花区"]      //县级名称
             },

            {
                cityName:"株洲市",  //市级名称
                countyName:["荷塘区", "芦淞区", "石峰区", "天元区", "渌口区"]      //县级名称
            },

            {
                cityName:"湘潭市",  //市级名称
                countyName:["雨湖区", "岳塘区", "湘潭县", "湘乡市", "韶山市"]      //县级名称
            }
        ]
    },

    {
        provinceName:"广东省",       //省级：省级名称
        city:[                      //市级
            {
                cityName:"广州市",  //市级名称
                countyName:["越秀区", "海珠区", "荔湾区",  "天河区", "白云区"]      //县级名称
            },

            {
                cityName:"深圳市",  //市级名称
                countyName:["福田区", "罗湖区", "盐田区", "南山区", "宝安区"]      //县级名称
            },

            {
                cityName:"珠海市",  //市级名称
                countyName:["香洲区", "金湾区", "斗门区"]      //县级名称
            }
        ]
    },

    {
        provinceName:"广西省",       //省级：省级名称
        city:[                      //市级
            {
                cityName:"桂林市",  //市级名称
                countyName:["灌阳县", "荔蒲县", "临桂县"]      //县级名称
            },

            {
                cityName:"河池市",  //市级名称
                countyName:["东兰县", "都安瑶族自治县", "凤山县"]      //县级名称
            },

            {
                cityName:"贺州市",  //市级名称
                countyName:["富川瑶族自治县", "昭平县", "钟山县"]      //县级名称
            }
        ]
    }

]